START TRANSACTION;
INSERT INTO `vendors` VALUES
    (2000, 'Emafyl', 'Holms str, 21', 'Tothenhem', 'Киев', 'Devonshir', '00001', 'England', '708-555-9555', '708-555-7547', 1),
    (3000, 'SmapFill', 'Picadily sqv, 15', 'Milano', 'Киев', '', '00002', 'Italy', '345-867-3246', '345-574-9992', 1),
    (4000, 'Toledana', '', '', 'Киев', '', '00003', 'Spain', '', '', NULL),
    (5000, 'Garcia', '', '', 'Киев', '', '00004', 'Spain', '', '', NULL),
    (6000, 'Гомельдрев', '', '', 'Гомель', '', '00005', 'Беларусь', '', '', NULL),
    (7000, 'Искусство', '', '', 'Чернигов', '', '00006', 'Украина', '', '', NULL),
    (8000, 'RomRama', '', '', 'Львов', '', '00007', 'Украина', '80677238619', '', NULL),
    (9000, 'In.co.m', '', '', 'Киев', '', '00008', 'Italy', '', '', NULL),
    (10000, 'Николаев', '', '', 'Николаев', '', '00009', 'Украина', '', '', NULL),
    (11000, 'Салон Багет', '', '', 'Киев', '', '', 'China', '80442750102', '80503560236', NULL),
    (12000, 'Ars Longa', 'Симферополь', '', 'Симферополь', '', '', 'China', '', '', NULL),
    (13000, 'Фурнитура', '', '', 'Николаев', '', '', 'Украина', '', '', NULL),
    (14000, 'Dominatore', 'Одесса', '', 'Одесса', '', '', 'Украина', '0976117777', '', NULL),
    (15000, 'Intact-Art', 'ул. Островского, 64', 'tanya@ramako.com.ua', 'Нововолынск', 'Волынская', '', 'Hungary', '0673407981', '(03344) 2-45-21', NULL),
    (16000, 'Artmidav', 'ул. Геологов, 22', '', 'Хмельницкий', '', '', 'China', '0979053529', '', NULL),
    (17000, 'Midav Frame', '', '', 'Хмельницкий', '', '', 'Украина', '', '', NULL),
    (18000, 'Основа', '', '', 'Одесса', '', '', 'China', '', '', NULL),
    (19000, 'Лелека', '', '', 'Киев', '', '', 'Turkey', '', '', NULL),
    (20000, 'DART Molding', '', '', 'Хмельницкий', '', '', 'China', '', '', NULL),
    (21000, 'Student', '', '', 'Киев', '', '', 'Europe', '', '', NULL);
COMMIT ;